In [73]:
import pandas as pd

studentsfile = "Resources/students_complete.csv"
schoolsfile = "Resources/schools_complete.csv"

students_df = pd.read_csv(studentsfile)
schools_df = pd.read_csv(schoolsfile)

In [74]:
students_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [75]:
schools_df.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [76]:
#find totals by calling count on any column in each data frame
totalschools = schools_df['school_name'].count()
totalstudents = students_df['Student ID'].count()

#basic math for sum and averages
totalbudget = schools_df['budget'].sum()
read_mean = students_df['reading_score'].mean()
math_mean = students_df['math_score'].mean()

#create new df of just passing students, count how many (in any column) and divide by total
read_pass_df = students_df.loc[students_df['reading_score'] >= 70]
read_pass = (read_pass_df['reading_score'].count())/ (students_df['reading_score'].count())

#repeat process for math passing
math_pass_df = students_df.loc[students_df['math_score'] >= 70]
math_pass = (math_pass_df['math_score'].count())/ (students_df['reading_score'].count())

#check if those who passed reading also passed math
both_pass_df = math_pass_df.loc[math_pass_df['reading_score'] >= 70]
both_pass = (both_pass_df['reading_score'].count()/ students_df['reading_score'].count())
both_pass

0.6517232575950983

In [77]:
#create distric summary df
summary_df = pd.DataFrame({"Total Schools": [totalschools],
              "Total Students": [totalstudents],
              "Total Budget": [totalbudget],
              "Passing % for Reading": [read_pass],
              "Passing % for Math": [math_pass],
              "Passing % for Both": [both_pass]})
summary_df.reset_index(drop=True)
summary_df

,Total Schools,Total Students,Total Budget,Passing % for Reading,Passing % for Math,Passing % for Both
0,15,39170,24649428,0.858055,0.749809,0.651723

In [78]:
#moving on to school summaries
#calculates per student budget and creates a new column
schools_df['Per Student Budget'] = schools_df['budget']/schools_df['size']
schools_df['% Passing for Reading'] = 
schools_df.head()

,School ID,school_name,type,size,budget,Per Student Budget
0,0,Huang High School,District,2917,1910635,655.0
1,1,Figueroa High School,District,2949,1884411,639.0
2,2,Shelton High School,Charter,1761,1056600,600.0
3,3,Hernandez High School,District,4635,3022020,652.0
4,4,Griffin High School,Charter,1468,917500,625.0

In [79]:
#prepare student data in new grouped df before adding to school summary df
grouped_students = students_df.groupby('school_name')
read_by_school = pd.DataFrame(grouped_students['reading_score'].mean())
math_by_school = pd.DataFrame(grouped_students['math_score'].mean())

In [82]:
#merge new dfs with school summary to add new calculations
merge1_df = pd.merge(schools_df, read_by_school, on="school_name")
merged_df = pd.merge(merge1_df, math_by_school, on="school_name")
merged_df

,School ID,school_name,type,size,budget,Per Student Budget,reading_score,math_score
0,0,Huang High School,District,2917,1910635,655.0,81.182722,76.629414
1,1,Figueroa High School,District,2949,1884411,639.0,81.158020,76.711767
2,2,Shelton High School,Charter,1761,1056600,600.0,83.725724,83.359455
3,3,Hernandez High School,District,4635,3022020,652.0,80.934412,77.289752
4,4,Griffin High School,Charter,1468,917500,625.0,83.816757,83.351499
5,5,Wilson High School,Charter,2283,1319574,578.0,83.989488,83.274201
6,6,Cabrera High School,Charter,1858,1081356,582.0,83.975780,83.061895
7,7,Bailey High School,District,4976,3124928,628.0,81.033963,77.048432
8,8,Holden High School,Charter,427,248087,581.0,83.814988,83.803279
9,9,Pena High School,Charter,962,585858,609.0,84.044699,83.839917
10,10,Wright High School,Charter,1800,1049400,583.0,83.955000,83.682222
11,11,Rodriguez High School,District,3999,2547363,637.0,80.744686,76.842711
12,12,Johnson High School,District,4761,3094650,650.0,80.966394,77.072464
13,13,Ford High School,District,2739,1763916,644.0,80.746258,77.102592
14,14,Thomas High School,Charter,1635,1043130,638.0,83.848930,83.418349

In [89]:
students_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84